Конфигурация/Documents/РаспределениеДоходаПайщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РаспределениеДоходаПайщикам</Name>
			<BasedOn>
				<xr:Item>Document.РаспределениеДоходаПайщикам</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияНалогов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОпределенияСпискаЛиц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходаКРаспределению</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПаев</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеДоходаПайщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВыплатыНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВыплатыОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеДохода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пайщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучательДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПаев</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачислениеНДФЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолучательДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДФЛ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДФЛ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДолиПайщиковВИнвестиционномФонде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДолиПайщиковВИнвестиционномФонде</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Comment>Дата записи в миллисекундах, для контроля последовательности проведения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Documents/РаспределениеДоходаПайщикам/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",
		Справочники.УправляющиеКомпании.ПолучитьПИФыПоЮрФизЛицуУправляющейКомпании(Объект.Дата, Объект.Организация.ЮрФизЛицо)));
	
	Элементы.ПаевойИнвестиционныйФонд.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры
#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьСчетДоверительногоУправления(Знач ПаевойИнвестиционныйФонд, Знач Период)
	
	Возврат Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ПаевойИнвестиционныйФонд, Период);	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы      = Форма.Элементы; 
	
	ЭтоРПИ = (ДанныеОбъекта.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ"));
	
	Элементы.ГруппаОпределениеДохода.Видимость = Не ЗначениеЗаполнено(ДанныеОбъекта.Основание);

	Элементы.ГруппаВычислениеСуммыВыплаты.Видимость = Не ЗначениеЗаполнено(ДанныеОбъекта.Основание) И НЕ ЭтоРПИ;
	
	Элементы.ФормаЗаполнить.Видимость = ЭтоРПИ;
	
	Элементы.ГруппаНачислениеНДФЛ.Видимость = ЭтоРПИ; 
	
	Элементы.Основание.Видимость = ЭтоРПИ;
	
КонецПроцедуры // НастроитьВидимостьИДоступность

&НаКлиенте
Процедура ПаевойИнвестиционныйФондПриИзменении(Элемент)
	
	Объект.СчетДоверительногоУправления = ПолучитьСчетДоверительногоУправления(Объект.ПаевойИнвестиционныйФонд, Объект.Дата);
	ЗаполнитьКоличествоПаев();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоПаев()
	
	Если ЗначениеЗаполнено(Объект.ПаевойИнвестиционныйФонд) 
		И ЗначениеЗаполнено(Объект.ДатаОпределенияСпискаЛиц) 
		И НЕ ЗначениеЗаполнено(Объект.Основание) Тогда
		
		КоличествоПаевНовое = КоличествоПаев();
		Если Объект.КоличествоПаев = 0 Тогда
			Объект.КоличествоПаев = КоличествоПаевНовое;
			ЗаполнитьТабличнуюЧастьРаспределенияДохода();
		ИначеЕсли Объект.КоличествоПаев <> КоличествоПаевНовое Тогда 
			Ответ = Вопрос("Перезаполнить количество паев?", РежимДиалогаВопрос.ДаНетОтмена,0);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.КоличествоПаев = КоличествоПаевНовое;
				ЗаполнитьТабличнуюЧастьРаспределенияДохода();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьРаспределенияДохода()
	
	Если ЗначениеЗаполнено(Объект.ПаевойИнвестиционныйФонд) 
		И ЗначениеЗаполнено(Объект.ДатаОпределенияСпискаЛиц)
		И ЗначениеЗаполнено(Объект.СуммаДоходаКРаспределению) Тогда
		
		Ответ = Вопрос("Заполнить пайщиков?", РежимДиалогаВопрос.ДаНетОтмена,0);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаполнитьТабличнуюЧастьРаспределенияДоходаНаСервере();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьРаспределенияДоходаНаСервере()
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.РаспределениеДоходаПайщикам"));
	ОбъектДокумента.ЗаполнитьРаспределениеДохода();
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	
КонецПроцедуры

&НаСервере
Функция КоличествоПаев()
	
	Если ЗначениеЗаполнено(Объект.ПаевойИнвестиционныйФонд) И НЕ ЗначениеЗаполнено(Объект.Основание) Тогда
		//заполнить количество паев
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток) КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
			|			&НачалоДня,
			|			Организация = &Организация
			|				И ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК ДолиПайщиковВИнвестиционномФондеОстатки";
		
		Запрос.УстановитьПараметр("НачалоДня", КонецДня(Объект.ДатаОпределенияСпискаЛиц));
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", Объект.ПаевойИнвестиционныйФонд);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.КоличествоОстаток;
		КонецЦикла;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ДатаОпределенияДоходаПриИзменении(Элемент)
	ЗаполнитьКоличествоПаев();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьДоход(Команда)
	ЗаполнитьТабличнуюЧастьРаспределенияДоходаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачислитьНДФЛ(Команда)
	РассчитатьНДФЛНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьНДФЛНаСервере()
	
	Отказ = Ложь;
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.РаспределениеДоходаПайщикам"));
	
	ОбъектДокумента.ЗаполнитьНДФЛ(Отказ);
	
	Если Не Отказ Тогда
		ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНалог()
	
	ТД = ЭтаФорма.Элементы.НачислениеНДФЛ.ТекущиеДанные;
	
	ТД.СуммаНДФЛ = ПересчитатьНалогНаСервере(ТД.ПолучательДохода, ТД.СуммаДохода, ТД.СтавкаНДФЛ);
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьНалогНаСервере(ПолучательДохода, СуммаДохода, СтавкаНДФЛ)
	
	ТаблицаДохода = Новый ТаблицаЗначений;
	ТаблицаДохода.Колонки.Добавить("ПолучательДохода", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	ТаблицаДохода.Колонки.Добавить("СуммаДохода", Новый ОписаниеТипов("Число"));
	ТаблицаДохода.Колонки.Добавить("СтавкаНДФЛ", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДФЛ"));
	ТаблицаДохода.Колонки.Добавить("СуммаНДФЛ", Новый ОписаниеТипов("Число"));
	
	СтрокаДохода = ТаблицаДохода.Добавить();
	СтрокаДохода.ПолучательДохода = ПолучательДохода;
	СтрокаДохода.СуммаДохода = СуммаДохода;
	СтрокаДохода.СтавкаНДФЛ = СтавкаНДФЛ;
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.РаспределениеДоходаПайщикам"));
	ОбъектДокумента.ЗаполнитьНДФЛ(Ложь, ТаблицаДохода);
	
	Возврат ТаблицаДохода[0].СуммаНДФЛ;
	
КонецФункции

&НаКлиенте
Процедура НачислениеНДФЛСуммаДоходаПриИзменении(Элемент)
	ПересчитатьНалог();
КонецПроцедуры

&НаКлиенте
Процедура НачислениеНДФЛСтавкаНДФЛПриИзменении(Элемент)
	ПересчитатьНалог();
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Объект.ДатаОпределенияСпискаЛиц = 0;
		Объект.СуммаДоходаКРаспределению = 0;
		Объект.КоличествоПаев = 0;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	ЭтоРПИ = (Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ"));
	
	Если НЕ ЭтоРПИ Тогда
		Объект.ПериодВыплатыОкончание = КонецМесяца(ДобавитьМесяц(Объект.Дата, -1));
		Объект.ПериодВыплатыНачало = НачалоКвартала(Объект.ПериодВыплатыОкончание);
		// нужна настройка?
		// У Долгосрочных облигаций выплата раз в квартал?
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуВыплатыНаСервере()

	ОбъектДокумента = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.РаспределениеДоходаПайщикам"));
	ОбъектДокумента.РассчитатьСуммуВыплатыИЗаполнитьРаспределениеДохода();
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияРеквизитовДляРасчетаСуммыВыплаты()
	
	СписокЗаполнения = "";
    РезультатПроверки = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.ПаевойИнвестиционныйФонд) Тогда 
		РезультатПроверки = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Паевой инвестиционный фонд, ";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОпределенияСпискаЛиц) Тогда 
		РезультатПроверки = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Дата определения списка лиц, ";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ПериодВыплатыНачало) Тогда 
		РезультатПроверки = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Период выплаты начало, ";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ПериодВыплатыОкончание) Тогда 
		РезультатПроверки = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Период выплаты окончание, ";
	КонецЕсли;
	
	Если Не РезультатПроверки Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте заполнение реквизитов: " + Лев(СписокЗаполнения, СтрДлина(СписокЗаполнения) - 2)); 
	КонецЕсли;
		
	Возврат РезультатПроверки;
	
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуВыплаты(Команда)
	
	Если ПроверкаЗаполненияРеквизитовДляРасчетаСуммыВыплаты() Тогда
		РассчитатьСуммуВыплатыНаСервере();
	КонецЕсли;
	
КонецПроцедуры
